//Урок 1.

//Задача 2. Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*Console.Write("Ввести первое число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Ввести второе число: ");
int num2 = Convert.ToInt32(Console.ReadLine());

if(num1 > num2)
    Console.WriteLine(num1 + " = макс, " + num2 + " = мин. ");
if(num1 < num2)
    Console.WriteLine(num2 + " = макс, " + num1 + " = мин. ");
    */

    
